# 3.	Магазин за цветя
# Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета. Цените зависят от сезона.
# Сезон	Хризантеми	Рози	Лалета
# Пролет / Лято	2.00 лв./бр.	4.10 лв./бр.	2.50 лв./бр.
# Есен / Зима	3.75 лв./бр.	4.50 лв./бр.	4.15 лв./бр.
# В празнични дни цените на всички цветя се увеличават с 15%. Предлагат се следните отстъпки:
# •	За закупени повече от 7 лалета през пролетта – 5% от цената на целият букет.
# •	За закупени 10 или повече рози през зимата – 10% от цената на целият букет.
# •	За закупени повече от 20 цветя общо през всички сезони – 20% от цената на целият букет.
# Отстъпките се правят по така написания ред и могат да се наслагват!
# Всички отстъпки важат след оскъпяването за празничен ден!
# Цената за аранжиране на букета винаги е 2лв. Напишете програма, която изчислява цената за един букет.
# Вход
# Входът се чете от конзолата и съдържа точно 5 реда:
# •	На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
# •	На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
# •	На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
# •	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
# •	На петия ред е посочено дали денят е празник – [Y – да / N - не]
# Изход
# Да се отпечата на конзолата 1 число – цената на цветята,
# форматирана до вторият знак след десетичната запетая.
chrysanthemums = int(input())
roses = int(input())
tulips = int(input())
season = input()
boolean = input()
roses_price = float()
tulips_price = float()
chrysanthemums_price = float()
all_flowers = roses + tulips + chrysanthemums
if season == "Summer" or season == "Spring":
    roses_price = roses * 4.10
    tulips_price = tulips * 2.50
    chrysanthemums_price = chrysanthemums * 2.00
elif season == "Winter" or season == "Autumn":
    roses_price = roses * 4.50
    tulips_price = tulips * 4.15
    chrysanthemums_price = chrysanthemums * 3.75
bouquet = roses_price + tulips_price + chrysanthemums_price
if boolean == "Y":
   bouquet *= 1.15
if tulips > 7 and season == "Spring":
        bouquet *= 0.95
elif roses >= 10 and season == "Winter":
        bouquet *= 0.90
if all_flowers > 20:
        bouquet *= 0.80
bouquet += 2
print(f'{bouquet:.2f}')
