# Задача 1. Басейн
# Преподавателският екип на СофтУни организира работен ден на басейн по случай настъпването на лятото. Вашата задача е да напишете програма, която да изчислява каква сума трябва да се заплати. За всеки един човек от екипа трябва да се заплати такса вход. Трябва да имате предвид, че един чадър стига за двама души. Знае се, че само 75% от екипа искат шезлонги. При изчислението на броя на чадърите и шезлонгите, техният брой да се закръгли до по-голямото цяло число.
# Вход
# От конзолата се четат 4 числа:
# 1.	Първи ред – брой на хората. Цяло число в интервала [1…100]
# 2.	Втори ред – такса вход. Реално число в интервала [0.00…50.00]
# 3.	Трети ред – цена един за шезлонг. Реално число в интервала [0.00…50.00]
# 4.	Четвърти ред – цена за един чадър. Реално число в интервала [0.00...50.00]
# Изход
# "{сумата за покриване на разходите} lv."
# Резултатът да се форматира до втората цифра след десетичния знак.
from math import ceil
people = int(input())
taxes = float(input())
sunbed = float(input())
umbrella = float(input())
entrance = people * taxes
money_for_sunbed = (ceil(people * 0.75)) * sunbed
money_for_umbrella = (ceil(people * 0.5)) * umbrella
all_money = money_for_sunbed + money_for_umbrella + entrance
print(f'{all_money:.2f} lv.')
