# Задача 4. Клуб
# Времето се затопля и клубовете пускат обещаващи промоции. Напише програма, която да изчислява приходите на един клуб за вечерта и дали е достигната желаната печалба, като знаете следните условия: цената на един коктейл е дължината неговото име. Ако цената на една поръчка е нечетно число, има 25% отстъпка от цената на поръчката.
# Вход
# От конзолата се четат:
# •	На първия ред – желаната печалба на клуба - реално число в интервала [1.00... 15000.00]
# Поредица от два реда до получаване на командата "Party!" или до достигане на желаната печалба:
# o	Име на коктейла – текст
# o	Брой на коктейлите за поръчката – цяло число в интервала [1… 50]
# Изход
# На конзолата първо да се отпечата един ред:
# •	При получена команда "Party!":
#  "We need {недостигаща сума} leva more."
# •	При достигане на желаната печалба:
# 	"Target acquired."
# След това да се отпечата:
# 	"Club income - {приходи от клуба} leva."
# Парите да бъдат форматирани до втората цифра след десетичния знак.
wanted_price = float(input())
command = input()
is_reached = False
all_price = 0
while command != "Party!":
    price = 0
    count = int(input())
    price += count * len(command)
    if price % 2 != 0:
        price *= 0.75
    all_price += price
    if all_price >= wanted_price:
        is_reached = True
        break
    command = input()
if is_reached:
    print("Target acquired.")
else:
    print(f"We need {abs(wanted_price - all_price):.2f} leva more.")
print(f"Club income - {all_price:.2f} leva.")