# В една кинозала столовете са наредени в правоъгълна форма в r реда и c колони.
# Има три вида прожекции с билети на различни цени:
# •	Premiere – премиерна прожекция, на цена 12.00 лева;
# •	Normal – стандартна прожекция, на цена 7.50 лева;
# •	Discount – прожекция за деца, ученици и студенти на намалена цена от 5.00 лева.
# Напишете програма, която чете тип прожекция (текст),
# брой редове и брой колони в залата (цели числа),
# въведени от потребителя, и изчислява общите приходи от билети при пълна зала.
# Резултатът да се отпечата във формат 2 знака след десетичната точка.
type_film = input()
r = int(input())
c = int(input())
n = float()
all_places = r * c
if type_film == "Premiere":
    n = all_places * 12
elif type_film == "Normal":
    n = all_places * 7.5
elif type_film == "Discount":
    n = all_places * 5
print(f'{n:.2f} leva')