# Напишете програма, която чете две цели числа (N1 и N2) и оператор,
# с който да се извърши дадена математическа операция. Възможните операции са:
# Събиране(+), Изваждане(-), Умножение(*),  Деление(/) и Модулно деление(%).
# При събиране, изваждане и умножение на конзолата трябва да се отпечатат резултата
# и дали той е четен или нечетен. При обикновеното деление – резултата.
# При модулното деление – остатъка. Трябва да се има предвид,
# че делителят може да е равен на 0 (нула), а на нула не се дели.
# В този случай трябва да се отпечата специално съобщениe.
# Вход
# От конзолата се прочитат 3 реда, въведени от потребителя:
# N1 – цяло число;
# N2 – цяло число;
# Изход
# Да се отпечата на конзолата един ред:
# Ако операцията е събиране, изваждане или умножение:
# "{N1} {оператор} {N2} = {резултат} – {even/odd}"
# Ако операцията е деление:
# "{N1} / {N2} = {резултат}" – резултат, форматиран до втория знак след десетичната запетая
# Ако операцията е модулно деление:
# "{N1} % {N2} = {остатък}"
# В случай на деление с 0 (нула):
# "Cannot divide {N1} by zero"
n1 = int(input())
n2 = int(input())
operator = input()
odd_or_even = ''
result = float()
if operator == "+" or operator == "*" or operator == "-":
    if operator == "+":
        result = n1 + n2
        if result % 2 == 0:
            odd_or_even = 'even'
        else:
            odd_or_even = 'odd'
    elif operator == "*":
        result = n1 * n2
        if result % 2 == 0:
            odd_or_even = 'even'
        else:
            odd_or_even = 'odd'
    elif operator == "-":
        result = n1 - n2
        if result % 2 == 0:
            odd_or_even = 'even'
        else:
            odd_or_even = 'odd'
    print(f"{n1} {operator} {n2} = {result} - {odd_or_even}")
elif n2 == 0:
    print(f"Cannot divide {n1} by zero")
elif operator == "/":
    result = n1 / n2
    print(f"{n1} / {n2} = {result:.2f}")
elif operator == "%":
    result = n1 % n2
    print(f"{n1} % {n2} = {result}")


