# Производителите на вендинг машини искали да направят машините си да връщат възможно
# най-малко монети ресто. Напишете програма, която приема сума - рестото, което трябва да
# се върне и изчислява с колко най-малко монети може да стане това.
# Примерен вход и изход
# Вход	Изход	Обяснения
# 1.23	4	Рестото ни е 1 лев и 23 стотинки. Машината ни го връща с 4 монети: монета от 1 лев,
# монета от 20 стотинки, монета от 2 стотинки и монета от 1 стотинка.
#  2	1	Рестото ни е 2 лева. Машината ни го връща с 1 монета от 2 лева.
# 0.56	3	Рестото ни е 56 стотинки. Машината ни го връща с 3 монети: монета от 50 стотинки,
# монета от 5 стотинки и монета от 1 стотинка.
# 2.73	5	Рестото ни е 2 лева и 73 стотинки. Машината ни го връща с 5 монети: монета от 2 лева,
# монета от 50 стотинки, монета от 20 стотинки, монета от 2 стотинки и монета от 1 стотинка.
change = float(input())

count_coins = 0
change_coins = change * 100

while True:
    count_coins += 1
    if change_coins >= 200:
        change_coins -= 200
    elif change_coins >= 100:
        change_coins -= 100
    elif change_coins >= 50:
        change_coins -= 50
    elif change_coins >= 20:
        change_coins -= 20
    elif change_coins >= 10:
        change_coins -= 10
    elif change_coins >= 5:
        change_coins -= 5
    elif change_coins >= 2:
        change_coins -= 2
    elif change_coins >= 1:
        change_coins -= 1
    if change_coins < 1:
        break
print( count_coins )







