# Задача 1. Учебни материали
# Учебната година вече е започнала и отговорничката на 10Б клас -
# Ани трябва да купи определен брой пакетчета с химикали, пакетчета с маркери,
# както и препарат за почистване на дъска.
# Тя е редовна клиентка на една книжарница, и има намаление за нея,
# което представлява някакъв процент от общата сума. Напишете програма,
# която изчислява колко пари ще трябва да събере Ани, за да плати сметката,
# като имате предвид следния ценоразпис:
# •	Пакет химикали - 5.80 лв
# •	Пакет маркери - 7.20 лв
# •	Препарат - 1.20 лв (за литър)
# Вход
# От конзолата се четат 4 числа:
# •	Първи ред - брой пакети химикали. Цяло число в интервала [0...100]
# •	Втори ред - брой пакети маркери. Цяло число в интервала [0...100]
# •	Трети ред - литър препарат за почистване на дъска. Реално число в интервала [0.00…50.00]
# •	Четвърти ред - процентът намаление. Цяло число в интервала [0...100]
# Изход
# Да се отпечата на конзолата колко пари ще са нужни на Ани, за да си плати сметката.
# Резултатът да се ФОРМАТИРА до третия знак след десетичната запетая.
pencils = int(input()) * 5.8
markers = int(input()) * 7.2
cleaner = float(input()) * 1.2
all = pencils + markers + cleaner
discount = int(input())
all = all - all * discount / 100
print(f'{all:.3f}')


