# Катерачи от цяла България се събират на групи и набелязват следващите върхове за изкачване. Според размера на групата, катерачите ще изкачват различни върхове.
# •	Група до 5 човека– Мусала
# •	Група от 6 до 12 – Монблан
# •	Група от 13 до 25 – Килиманджаро
# •	Група от 26 до 40 – К2
# •	Група от 41 или повече – Еверест
# Да се напише програма, която изчислява процента на катерачите изкачващи всеки връх.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на групите от катерачи – цяло число в интервала [1...1000]
# •	За всяка една група на отделен ред – броя на хората в групата – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 5 реда, всеки от които съдържа процент между
# 0.00% и 100.00% с точност до втората цифра след десетичната запетая.
# •	Първи ред - процентът изкачващи Мусала
# •	Втори ред – процентът изкачващи Монблан
# •	Трети ред – процентът изкачващи Килиманджаро
# •	Четвърти ред – процентът изкачващи К2
# •	Пети ред – процентът изкачващи Еверест
groups = int(input())
Musala = 0
Monblan = 0
Kilimangjaro = 0
K2 = 0
Everest = 0
everybody = 0
for c in range(1 , groups + 1):
    people = int(input())
    everybody += people
    if people <= 5:
        Musala += people
    elif 6 <= people <= 12:
        Monblan += people
    elif 13 <= people <= 25:
        Kilimangjaro += people
    elif 26 <= people <= 40:
        K2 += people
    elif people >= 41:
        Everest += people
print(f'{Musala / everybody:.2%}')
print(f'{Monblan / everybody:.2%}')
print(f'{Kilimangjaro / everybody:.2%}')
print(f'{K2 / everybody:.2%}')
print(f'{Everest / everybody:.2%}')