# Бабата на Деси всяка година приготвя обяд за семейството си за
# Великден. Напишете програма, която изчислява какви разходи ще
# има по приготвянето на обяда, като знаете колко броя козунаци,
# кори с яйца и килограма курабии е купила.
# Цените на продуктите са следните:
# •	Козунак  – 3.20 лв.
# •	Яйца –  4.35 лв. за кора с 12 яйца
# •	Курабии – 5.40 лв. за килограм
# •	Боя за яйца - 0.15 лв. за яйце
# Вход
# От конзолата се четат 3 реда:
# •	Брой козунаци - цяло число в интервала [0 … 99]
# •	Брой кори с яйца - цяло число в интервала [0 … 99]
# •	Килограми курабии - цяло число в интервала [0 … 99]
# Изход
# Да се отпечата на конзолата колко ще са разходите по приготвянето
# на обяда. Сумата да бъде форматирана до втория знак след десетичната запетая.
# Примерен вход и изход
Easter_bread = int(input())
packets_of_eggs = int(input())
kg_cookies = int(input())
price_for_easter_bread = Easter_bread * 3.2
price_for_packet = packets_of_eggs * 4.35
price_for_cookies = kg_cookies * 5.4
price_for_eggs = 0.15 * packets_of_eggs * 12
all_price = price_for_packet + price_for_cookies + price_for_easter_bread + price_for_eggs
print(f'{all_price:.2f}')