#  Задача 4. Ремонт
# Пешо решава, че иска да направи ремонт вкъщи. Неговата задача е да боядиса стените в хола, като знаете височината и ширината на една стена. Холът на Пешо има 4 стени с еднакви размери, определен процент от които се заемат от прозорци и врати, които няма да бъдат боядисвани. Той не е сигурен дали ще успее наведнъж, затова моли Вас да му помогнете да изчисли дали ще му остава още работа за следващия ден и, ако да, колко кв. м. има да довърши, а в случай, че успее да боядиса хола, колко боя му е останала (трябва да се има предвид, че с един литър боя се боядисва един квадратен метър от стената).
# Вход
# От конзолата се четат следните редове:
# 1.	Височина на стената - цяло число [0… 100]
# 2.	Ширина на стената - цяло число [0… 100]
# 3.	Процент от общата площ на стените, който няма да бъде боядисан - цяло число [5… 95]
# На следващите редове до получаване на командата "Tired!" или докато не бъдат боядисани всички стени, се чете по едно число:
# •	Литри боя – цяло число [0…100]:
# Забележка: Площта за боядисване да бъде закръглена нагоре до най-близкото цяло число.
# Изход
# Да се отпечата на конзолата един от следните редове:
# •	При получаване на командата "Tired!":
# "{квадратни метри} quadratic m left."
# {квадратни метри} е повърхнината, която му остава да боядисана.
# •	Aко е останала боя в излишък:
# "All walls are painted and you have {литри боя} l
#  paint left!"
# •	Aко след боядисването на всички стени, не е останала боя:
# "All walls are painted! Great job, Pesho!"
from math import ceil
height = int(input())
width = int(input())
percent = int(input())
all_ = (height * width * 4) - percent / 100 * (height * width * 4)
command = input()
is_painted = False
while command != "Tired!":
    paint = int(command)
    all_ -= paint
    if all_ <= 0:
        is_painted = True
        break
    command = input()
if is_painted:
    if all_ == 0:
        print("All walls are painted! Great job, Pesho!" )
    else:
        print(f"All walls are painted and you have {ceil(abs(all_))} l paint left!" )
else:
    print(f"{ceil(all_)} quadratic m left." )