# С наближаването на световното първенство по снукър в театъра Крусибъл в Шефилд, Англия,
# феновете нямат търпение да се сдобият с ценните билети. Заради големия наплив от хора,
# организаторите ви молят да напишете програма за продаване на билети, като се има предвид следния ценоразпис:
# 	Четвъртфинал	Полуфинал	Финал
# Стандартен	55.50 £/бр.	75.88 £/бр.	110.10 £/бр.
# Премиум	105.20 £/бр.	125.22 £/бр.	160.66 £/бр.
# ВИП	118.90 £/бр.	300.40 £/бр.	400 £/бр.
# При закупуване на билет, зрителят може да избере опция, снимка с трофея, на цена 40 лири.
# При достигане на определена сума има отстъпки:
# •	Над 4000 лири има 25% отстъпка и безплатни снимки с трофея (ако  опцията за снимки е избрана, таксата от 40 лири за
# билет не се включва)
# •	Над 2500 лири има 10% отстъпка
# При избрана опция за снимки с трофея, цената се начислява след изчисляването на отстъпките.
# Вход
# От конзолата се четат 3 реда:
# 1.	Етап на първенството – текст - “Quarter final ”, “Semi final” или “Final”
# 2.	Вид на билета – текст - “Standard”, “Premium” или “VIP”
# 3.	Брой билети – цяло число в интервала [1 … 30]
# 4.	Снимка с трофея – символ – 'Y' (да) или 'N' (не)
# Изход
# На конзолата се отпечатва 1 ред:
# •	"Цената, която трябва да се заплати, форматирана до втората цифра след десетичния знак"
phase = input()
type_ = input()
count = int(input())
trophy = input()
price = 0
is_not_trophy = False
if phase == "Quarter final":
    if type_ == "Standard":
        price = 55.5
    elif type_ == "Premium":
        price = 105.2
    elif type_ == "VIP":
        price = 118.9
elif phase == "Semi final":
    if type_ == "Standard":
        price = 75.88
    elif type_ == "Premium":
        price = 125.22
    elif type_ == "VIP":
        price = 300.4
elif phase == "Final":
    if type_ == "Standard":
        price = 110.1
    elif type_ == "Premium":
        price = 160.66
    elif type_ == "VIP":
        price = 400
all_price = price * count

if all_price > 4000:
    all_price *= 0.75
    is_not_trophy =True
elif all_price > 2500:
    all_price *= 0.9
if trophy == "Y" and not is_not_trophy:
    all_price += 40 * count
print(f'{all_price:.2f}')





