# Сезона за изкачване на алпийски върхове започва
# и всички алпинисти, се запасяват с енергийни гелове за изкачването.
# Фирма предлага малки и големи разфасовки с по 2 бр. и 5 бр. енергийни гела,
# като цената на един гел зависи от плодовете, от които е направен. В зависимост
# от размера на разфасовката, цената за брой енергиен гел е различна.
# От конзолата се четат плодовете, размерът на опаковката ((малка) 2 бр. или
# (голяма) 5 бр.), както и колко разфасовки са поръчани. Да се напише програма,
# която изчислява сумата, която трябва да се плати за поръчката.
# 	Диня 	Манго	Ананас	Малина
# 2 броя (small)	56 лв./бр.	36.66 лв./бр.	42.10 лв./бр.	20 лв./бр.
# 5 броя (big)	28.70 лв./бр.	19.60 лв./бр.	24.80 лв./бр.	15.20 лв./бр.
# При поръчки:
# •	от 400 лв. до 1000 лв. включително има 15% отстъпка
# •	над 1000 лв. има 50% отстъпка
# Вход
# От конзолата се четат 3 реда:
# 1.	Плод - текст с възможности: "Watermelon", "Mango", "Pineapple" или "Raspberry"
# 2.	Размерът на сета - текст с възможности: "small" или "big"
# 3.	Брой на поръчаните сетове - цяло число в интервала [1 … 10000]
# Изход
# На конзолата се отпечатва 1 ред:
# •	Цената, която трябва да се заплати, форматирана до втория знак след десетичната запетая,
# в следния формат:
# "{цената} lv."
fruit = input()
size = input()
set = int(input())
count = 0
price = 0
if size == "small":
    count = 2
    if fruit == "Watermelon":
        price += 56
    elif fruit == "Mango":
        price += 36.66
    elif fruit == "Pineapple":
        price += 42.10
    elif fruit == "Raspberry":
        price += 20
elif size == "big":
    count = 5
    if fruit == "Watermelon":
        price += 28.70
    elif fruit == "Mango":
        price += 19.60
    elif fruit == "Pineapple":
        price += 24.80
    elif fruit == "Raspberry":
        price += 15.20
all_price = price * count * set
if 400 <= all_price <= 1000:
    all_price *= 0.85
elif all_price > 1000:
    all_price *= 0.5
print(f"{all_price:.2f} lv.")