# Задача 5. Грижи за кученце
# Ани намира кученце, за което ще се грижи, докато се намери някой да го осинови.
# То изяжда дневно определено количество храна.
# Да се напише програма, която проверява дали количеството храна,
# което е закупено за кученцето, ще е достатъчно докато кученцето бъде осиновено.
# Вход
# От конзолата се прочитат:
# •	Закупеното количество храна за кученцето в килограми – цяло число в интервала [1 …100]
# •	На всеки следващ ред до получаване на команда Adopted
# ще получавате колко грама изяжда кученцето на всяко хранене -
# цяло число в интервала [10 …1000]
# Изход
# На конзолата се отпечатва 1 ред:
# •	Ако количеството храна е достатъчно да се отпечата:
#  	"Food is enough! Leftovers: {останала храна} grams."
# •	Ако количеството храна не е достатъчно да се отпечата:
#  	"Food is not enough. You need {нужно количество храна} grams more."
food = int(input()) * 1000
command = input()
all_eaten_food = 0
while command != "Adopted":
    command = int(command)
    all_eaten_food += command
    command = input()
if food >= all_eaten_food:
    print(f'Food is enough! Leftovers: {food -all_eaten_food } grams. ')
else:
    print(f'Food is not enough. You need {abs(food - all_eaten_food)} grams more.')

