# Задача 6. Коледен турнир
# Напишете програма, която проследява представянето на вашия отбор на
# благотворителен коледен турнир.
# Всеки ден получавате имена на игри до команда "Finish".
# Със спечелването на всяка една игра печелите по 20лв. за благотворителност.
# Трябва да изчислите колко пари сте спечелили на края на деня.
# Ако имате повече спечелени игри, отколкото загубени –
# вие сте победители този ден и увеличавате парите от него с 10%.
# При приключване на турнира ако през повечето дни сте били
# победители печелите турнира и увеличавате всичките спечелени пари с 20%.
# Никога няма да имате равен брой спечелени и загубени игри.
# Вход
# Първоначално от конзолата се прочита броя дни на турнира – цяло число в интервала [1… 20]
# До получаване на командата "Finish" се чете:
# •	Спорт  – текст
# За всеки спорт се прочита:
# o	Резултат  – текст с възможности: "win" или "lose"
# Изход
# Накрая се отпечатва един ред:
# •	Ако сте спечелили турнира:
#      	"You won the tournament! Total raised money: {спечелените пари}"
# •	Ако сте загубили на турнира:
# "You lost the tournament! Total raised money: {спечелените пари}"
# Парите да бъдат форматирани до втората цифра след десетичния знак.
tournament = int(input())
all_price = 0
all_win = 0
all_loose = 0
for c in range(1 , tournament +1):
    command = input()
    price = 0
    win = 0
    loose = 0
    while command != "Finish":
        win_or_loose = input()
        if win_or_loose == "win":
            win += 1
            all_win += 1
            price += 20
        elif win_or_loose == "lose":
            loose += 1
            all_loose += 1
        command = input()
    if win > loose:
        price *= 1.1
    all_price += price
if all_win> all_loose:
    all_price *= 1.2
    print(f"You won the tournament! Total raised money: {all_price:.2f}")
else:
    print(f"You lost the tournament! Total raised money: {all_price:.2f}")