# Футболен отбор участва в благотворителен турнир.
# На този турнир отборът играе три мача като домакин.
# Да се напише програма, която изчислява колко победи,
# равенства и загуби има отборът по време на турнира,
# спрямо резултатите от мачовете.
# *Забележка: Отборът винаги е домакин, следователно първата цифра от резултата съответства на головете вкарани от него.
# Вход
# От конзолата се четат 3 реда:
# 1.	Резултат от първия мач – текст
# 2.	Резултат от втория мач – текст
# 3.	Резултат от третия мач – текст
# Резултатите ще са в следния формат: "2:0", "0:1", "1:1" и т.н.
# /броят голове винаги ще бъде едноцифрено число/
# Изход
# На конзолата да се отпечатат три реда:
# •	"Team won {брой спечелени мачове} games."
# •	"Team lost {брой загубени мачове} games."
# •	" Drawn games: {брой равни мачове}"
first = input()
second = input()
third = input()
win = 0
lose = 0
draw = 0
if first[0] > first[2]:
    win += 1
elif first[0] < first[2]:
    lose += 1
else:
    draw += 1
if second[0] > second[2]:
    win += 1
elif second[0] < second[2]:
    lose += 1
else:
    draw += 1
if third[0] > third[2]:
    win += 1
elif third[0] < third[2]:
    lose += 1
else:
    draw += 1
print(f"Team won {win} games.")
print(f"Team lost {lose} games.")
print(f"Drawn games: {draw}")
