# Гошо работи в ресторант и отговаря за зареждането на съдомиялната накрая на деня.
# Вашата задача е да напишете програма, която изчислява,
# дали дадено закупено количество бутилки от препарат за съдомиялна е достатъчно,
# за да измие определено количество съдове. Знае се, че всяка бутилка съдържа 750 мл.
# препарат, за 1 чиния са нужни 5 мл., а за тенджера 15 мл.  Приемете, че на всяко трето
# зареждане със съдове, съдомиялната се пълни само с тенджери, а останалите пъти с чинии.
# Докато не получите команда "End" ще продължите да получавате бройка съдове, които трябва да
# бъдат измити.
# Вход
# От конзолата се четат:
# •	Брой бутилки от препарат, който ще бъде използван за миенето на чинии - цяло число в интервала [1…10]
# На всеки следващ ред, до получаване на командата "End" или докато количеството препарат не се
# изчерпи, брой съдове, които трябва да бъдат измити - цяло число в интервала [1…100]
# Изход
# В случай, че количеството препарат е било достатъчно за измиването на съдовете:
# "Detergent was enough!"
# "{брой чисти чинии} dishes and {брой чисти тенджери} pots were washed."
# "Leftover detergent {количество останал препарат} ml."
# В случай, че количеството препарат не е било достатъчно за измиването на съдовете:
# "Not enough detergent, {количество не достигнал препарат} ml. more necessary!"
all_ml = int(input()) * 750
command = input()
times = 0
our_ml = 0
is_True = False
pots = 0
dishes = 0
while command != "End":
    times += 1
    command = int(command)
    if times % 3 == 0:
        our_ml += command * 15
        pots += command
    else:
        our_ml += command * 5
        dishes += command
    if our_ml > all_ml:
        is_True = True
        break
    command = input()
if is_True:
    print(f"Not enough detergent, {our_ml - all_ml} ml. more necessary!")
else:
    print("Detergent was enough!" )
    print(f"{dishes} dishes and {pots} pots were washed.")
    print(f"Leftover detergent {all_ml - our_ml} ml.")

