# Напишете програма, която изчислява средната оценка на ученик от цялото му обучение.
# На първия ред ще получите името на ученика, а на всеки следващ ред - неговите годишни оценки.
# Ученикът преминава в следващия клас, ако годишната му оценка е по-голяма или равна на 4.00.
# Ако ученикът бъде скъсан повече от един път, то той бива изключен и програмата приключва,
# като се отпечатва името на ученика и в кой клас е изключен.
#  При успешно завършване на 12-ти клас да се отпечата :
# "{име на ученика} graduated. Average grade: {средната оценка от цялото обучение}"
# В случай, че ученикът е изключен от училище, да се отпечата:
# "{име на ученика} has been excluded at {класа, в който е бил изключен} grade"
# Стойността трябва да бъде форматирана до втория знак след десетичната запетая.
name = input()
school_class = 0
low_grade = 0
all_grades = 0
average = 0
while school_class < 12:
    grade = float(input())
    if grade < 4:
        low_grade += 1
    if low_grade == 2:
        print(f"{name} has been excluded at {school_class} grade")
        break
    school_class += 1
    all_grades += grade
    average = all_grades / school_class
else:
    print(f"{name} graduated. Average grade: {average:.2f}")

