# Отговаряте за логистиката на различни товари. В зависимост
# 0т теглото на товара е нужно различно превозно средство.
# Цената на тон, за която се превозва товара е различна за всяко превозно средство:
# •	До 3 тона – микробус (200 лева на тон)
# •	От 4 до 11 тона – камион (175 лева на тон)
# •	12 и повече тона – влак (120 лева на тон)
# Вашата задача е да изчислите средната цена на тон превозен товар,
# както и процента на тоновете  превозвани с всяко превозно средство, спрямо общото тегло(в тонове)
# на всички товари.
# Вход
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на товарите за превоз – цяло число в интервала [1...1000]
# •	За всеки един товар на отделен ред – тонажа на товара – цяло число в интервала [1...1000]
# Изход
# Да се отпечатат на конзолата 4 реда, както следва:
# •	Първи ред – средната цена на тон превозен товар (закръглена до втория знак след дес. запетая);
# •	Втори ред – процентът тона превозвани с микробус (процент между 0.00% и 100.00%);
# •	Трети ред – процентът  тона превозвани с камион (процент между 0.00% и 100.00%);
# •	Четвърти ред – процентът тона превозвани с влак (процент между 0.00% и 100.00%).
n = int(input())
minibus = 0
truck = 0
train = 0
count1 = 0
count2 = 0
count3 = 0
kg_count = 0
for b in range(1, n + 1):
    kg = int(input())
    if kg <= 3:
        minibus += 200 * kg
        count1 += kg
        kg_count += kg
    elif 4 <= kg <= 11:
        truck += kg * 175
        count2 += kg
        kg_count += kg
    elif kg >= 12:
        train += kg * 120
        count3 += kg
        kg_count += kg
print(f'{((minibus + truck + train)/ kg_count):.2f}')
print(f'{(count1 / kg_count):.2%}')
print(f'{(count2 / kg_count):.2%}')
print(f'{(count3 / kg_count):.2%}')



