# Напишете програма, която да пресмята статистика на оценки от изпит.
# В началото програмата получава броят на студентите явили се на изпита и за всеки студент неговата оценка.
# На края програмата трябва да изпечата процента на студенти с оценка между 2.00 и 2.99, между 3.00 и 3.99,
# между 4.00 и 4.99, 5.00 или повече. Също така и средният успех на изпита.
# От конзолата се четат поредица от числа, всяко на отделен ред:
# •	На първия ред – броя на студентите явили се на изпит – цяло число в интервала [1...1000]
# •	За всеки един студент на отделен ред – оценката от изпита – реално число в интервала [2.00...6.00]
# Изход
# Да се отпечатат на конзолата 5 реда, които съдържат следната информация:
# Ред 1 -	"Top students: {процент студенти с успех 5.00 или повече}%"
# Ред 2 -	"Between 4.00 and 4.99: {между 4.00 и 4.99 включително}%"
# Ред 3 -	"Between 3.00 and 3.99: {между 3.00 и 3.99 включително}%"
# Ред 4 -	"Fail: {по-малко от 3.00}%"
# Ред 5 -	"Average: {среден успех}"
# Всички числа трябва да са форматирани до вторият знак след десетичната запетая.
students = int(input())
top_students = 0
average = 0
students_bw_4_5 = 0
students_bw_3_4 = 0
fail = 0
for c in range(1, students + 1):
    grade = float(input())
    if grade >= 5:
        top_students += 1
        average += grade
    elif 4 <= grade <= 4.99:
        students_bw_4_5 += 1
        average += grade
    elif 3 <= grade <= 3.99:
        students_bw_3_4 += 1
        average += grade
    elif 2 <= grade <= 2.99:
        average += grade
        fail += 1
print(f'Top students: {(top_students / students):.2%}')
print(f'Between 4.00 and 4.99: {(students_bw_4_5 / students):.2%}')
print(f'Between 3.00 and 3.99: {(students_bw_3_4 / students):.2%}')
print(f'Fail: {(fail / students):.2%}')
print(f'Average: {(average / students):.2f}')
