from math import ceil
from math import floor

# Марина обича да пътува. Тя има 3 домашни любимеца (куче, котка и костенурка).
# Когато заминава на пътешествие трябва да съобрази колко храна да им остави, за да не останат гладни.
# Напишете програма, която пресмята колко килограма храна ще изядат всички за времето,
# в което Марина отсъства и дали оставената храна от нея ще им е достатъчна.
# Всяко животно изяжда определено количество храна на ден.
# Вход
# От конзолата се четат пет реда:
# Първи ред – брой дни – цяло число в интервал [1…5000]
#   Втори ред – оставена храна в килограми – цяло число в интервал [0…100000]
# Трети ред – храна на ден за кучето в килограми – реално число в интервал [0.00…100.00]
# Четвърти ред – храна на ден за котката в килограми– реално число в интервал [0.00…100.00]
# Пети ред – храна на ден за костенурката в грамове – реално число в интервал [0.00…10000.00]
days = int(input())
left_food = int(input())
day_food_d = float(input())
day_food_c = float(input())
day_food_t = float(input()) / 1000
needed_food = (day_food_c + day_food_t + day_food_d) * days
if left_food >= needed_food:
    c = floor(left_food - needed_food)
    print(f"{c} kilos of food left.")
else:
    c = ceil(abs(needed_food - left_food))
    print(f'{c} more kilos of food are needed.')


