from math import floor
from math import ceil

# Мария иска да купи подарък на сина си. Тя работи в магазин за цветя.
# В магазина идва поръчка за цветя.
# Напишете програма, която пресмята сумата от поръчката и дали печалбата е достатъчна за подаръка.
# Цветята имат следните цени:
# •	Магнолии – 3.25 лева
# •	Зюмбюли – 4 лева
# •	Рози – 3.50 лева
# •	Кактуси – 8 лева
# От общата сума, Мария трябва да плати 5% данъци.
# Вход
# Входът се чете от конзолата и се състои от 5 реда:
# •	Брой магнолии – цяло число в интервала [0 … 50]
# •	Брой зюмбюли – цяло число в интервала [0 … 50]
# •	Брой рози – цяло число в интервала [0 … 50]
# •	Брой кактуси – цяло число в интервала [0 … 50]
# •	Цена на подаръка – реално число в интервала [0.00 … 500.00]
# Изход
# На конзолата трябва да се отпечата един ред.
# •	Ако парите СА стигнали: "She is left with {останали} leva." –
# сумата трябва да е закръглена към по-малко цяло число (пр. 1.90 -> 1).
# •	Ако парите НЕ достигат: "She will have to borrow {останали} leva." –
# сумата трябва да е закръглена към по-голямо цяло число (пр. 1.10 -> 2).

magnolias = int(input()) * 3.25
hyacinths = int(input()) * 4
roses = int(input()) * 3.50
cactus = int(input()) * 8
present = float(input())
all_cost = (magnolias + hyacinths + cactus + roses)
final_cost = all_cost - all_cost * 0.05
if final_cost >= present:
    f = final_cost - present
    print(f'She is left with {floor(f)} leva.')
else:
    f = present - final_cost
    print(f"She will have to borrow {ceil(f)} leva.")
