# Напишете програма, която да изчислява, колко ще струва на един шофьор да напълни резервоара на автомобила си,
# като знаете – какъв тип гориво зарежда, каква е цената за литър гориво и дали разполага с карта за отстъпки.
# Цените на горивата са както следва:
# Бензин – 2.22 лева за един литър,
# Дизел – 2.33 лева за един литър
# Газ – 0.93 лева за литър
# Ако водача има карта за отстъпки,  той се възползва от следните намаления за литър гориво:
# 18 ст. за литър бензин, 12 ст. за литър дизел и 8 ст. за литър газ.
# Ако шофьора е заредил между 20 и 25 литра включително,
# той получава 8 процента отстъпка от крайната цена, при повече от 25 литра гориво,
# той получава 10 процента отстъпка от крайната цена.
# Вход
# Входът се чете от конзолата и се състои от 3 реда:
# Типа на горивото – текст с възможности: "Gas", "Gasoline" или "Diesel"
# Количество гориво – реално число в интервала [1.00 … 50.00]
# Притежание на клубна карта – текст с възможности: "Yes" или "No"
# Изход
# На конзолата трябва да се отпечата един ред.
# "{крайната цена на горивото} lv."
# Цената на горивото да бъде форматираната до втората цифра след десетичния знак.
fuel = input()
quantity = float(input())
card = input()
if fuel == 'Gas':
    gas = quantity * 0.93
    if card == 'Yes':
        gas = gas - quantity * 0.08
    if 20 < quantity <= 25:
            gas = gas - 0.08 * gas
    elif quantity > 25:
        gas = gas - 0.1 * gas
    print(f'{gas:.2f} lv.')
elif fuel == 'Gasoline':
    gasoline = quantity * 2.22
    if card == 'Yes':
        gasoline = gasoline - quantity * 0.18
    if 20 < quantity <= 25:
        gasoline = gasoline - 0.08 * gasoline
    elif quantity > 25:
        gasoline = gasoline - 0.1 * gasoline
    print(f'{gasoline:.2f} lv.')
elif fuel == 'Diesel':
    diesel = quantity * 2.33
    if card == 'Yes':
        diesel = diesel - quantity * 0.12
    if 20 < quantity <= 25:
        diesel = diesel - 0.08 * diesel
    elif quantity > 25:
        diesel = diesel - 0.1 * diesel
    print(f'{diesel:.2f} lv.')
