# Иван решава да подобри Световния рекорд по плуване на дълги разстояния.
# На конзолата се въвежда рекордът в секунди, който Иван трябва да подобри,
# разстоянието в метри, което трябва да преплува и времето в секунди,
# за което плува разстояние от 1 м. Да се напише програма, която изчислява дали се е справил със задачата,
# като се има предвид, че: съпротивлението на водата го забавя на всеки 15 м. с 12.5 секунди.
# Когато се изчислява колко пъти Иванчо ще се забави, в резултат на съпротивлението на водата,
# резултатът трябва да се закръгли надолу до най-близкото цяло число.
# Да се изчисли времето в секунди, за което Иванчо ще преплува разстоянието и разликата спрямо Световния рекорд.
# Вход
# От конзолата се четат 3 реда:
# 1.	Рекордът в секунди – реално число;
# 2.	Разстоянието в метри – реално число;
# 3.	Времето в секунди, за което плува разстояние от 1 м. - реално число.
record = float(input())
distance = float(input())
seconds = float(input())
if distance >= 15:
    slow = distance // 15
    all_time = distance * seconds + 12.5 * slow
else:
    all_time = distance * seconds

if record > all_time:

    print(f'Yes, he succeeded! The new world record is {all_time:.2f} seconds.')
else:
    difference = abs(record - all_time)
    print(f'No, he failed! He was {difference:.2f} seconds slower.')
