# Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент
# p1 са под 200, друг процент p2 са от 200 до 399, друг процент p3 са от 400 до 599,
# друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре. Да се напише програма,
# която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.
# Пример: имаме n = 20 числа: 53, 7, 56, 180, 450, 920, 12, 7, 150, 250, 680, 2, 600, 200, 8
# 00, 799, 199, 46, 128, 65. Получаваме следното разпределение и визуализация:
# Диапазон	Числа в диапазона	Брой числа	Процент
# < 200	53, 7, 56, 180, 12, 7, 150, 2, 199, 46, 128, 65	12	p1 = 12 / 20 * 100 = 60.00%
# 200 … 399	250, 200	2	p2 = 2 / 20 * 100 = 10.00%
# 400 … 599	450	1	p3 = 1 / 20 * 100 = 5.00%
# 600 … 799	680, 600, 799	3	p4 = 3 / 20 * 100 = 15.00%
# ≥ 800	920, 800	2	p5 = 2 / 20 * 100 = 10.00%
# Вход
# На първия ред от входа стои цялото число n (1 ≤ n ≤ 1000) – брой числа.
# На следващите n реда стои по едно цяло число в интервала [1…1000] –
# числата върху които да бъде изчислена хистограмата.
# Изход
# Да се отпечата на конзолата хистограмата – 5 реда, всеки от които съдържа число между 0% и 100%,
# с точност две цифри след десетичната точка, например 25.00%, 66.67%, 57.14%.
n = int(input())
count1 = 0
count2 = 0
count3 = 0
count4 = 0
count5 = 0
for c in range(1 , n + 1):
    number = int(input())
    if number < 200:
        count1 += 1
    elif 200 <= number <= 399:
        count2 += 1
    elif 400 <= number <= 599:
        count3 += 1
    elif 600 <= number <= 799:
        count4 += 1
    elif number > 799 :
        count5 += 1
first = count1 / n
second = count2 / n
third = count3 / n
forth = count4 / n
fifth = count5 / n
print(f'{first:.2%}')
print(f'{second:.2%}')
print(f'{third:.2%}')
print(f'{forth:.2%}')
print(f'{fifth:.2%}')
