# Задача 1. Книга за програмиране
# Един летен ден Автоном Иванов, автор на редица учебници и книги, решил да напише книга за програмиране, заедно с екип от няколко ентусиазирани младежи, които да му помогнат. Да се напише програма, която пресмята колко пари ще са нужни на Автоном за отпечатването на едно пробно копие на хартия, като екипът поема част от сумата. Книгата се състои от 899 страници и 2 корици и обикновено издателствата правят намаление (в проценти) за книги с подобен обем.
# Освен разходите по отпечатването на страниците и кориците, трябва да се заплати на дизайнер, който да изработи подходящо изображение за корицата.
# Вход:
# Входът от конзолата съдържа 5 реда:
# •	Цена за отпечатване на една страница - реално число в интервала (0.00…1.50]
# •	Цена за отпечатване на една корица - реално число в интервала (0.00…5.00]
# •	Процентно намаление за отпечатване на хартия - цяло число в интервала (0…100]
# •	Сумата, която трябва да се заплати на дизайнер - реално число в интервала (0.00…150.00]
# •	Процент от цялата дължима сума, който е заплатен от екипа - цяло число в интервала [0…100]
# Изход:
# На конзолата се отпечатва 1 ред:
# "Avtonom should pay {money} BGN."
# Където {money} е сумата, която трябва да бъде заплатена. Стойността трябва да бъде форматирана до втория знак след десетичната запетая.
price_for_str = float(input())
price_for_kr = float(input())
percent_reduction = int(input())
sum_for_dizainer = float(input())
percent_of_all = int(input())
beginning_sum = price_for_str * 899 + price_for_kr * 2
beginning_sum = beginning_sum - beginning_sum * percent_reduction / 100
all_money = beginning_sum + sum_for_dizainer
discount = all_money - all_money * percent_of_all / 100
print(f"Avtonom should pay {discount:.2f} BGN.")
