# Георги трябва да построи космически кораб, който да събира част от екипажа му. За целта, той трябва да го направи така, че да има място за поне трима астронавти, но за не повече от 10. Всеки астронавт се нуждае от малка стая, която да е с размери: 2 метра ширина, 2 метра дължина и с височина, която е с 40 см повече от средната височина на астронавтите.
# Напишете програма, която изчислява обема на кораба, колко астронавта ще събере и принтира на конзолата дали  корабът е достатъчно голям.
# Вход:
# Входът се чете от конзолата и съдържа точно 4 реда:
# •	На първия ред е широчината на кораба - реално число в интервала [1.00... 10.00]
# •	На втория ред е  дължината на кораба - реално число в интервала [1.00…10.00]
# •	На третия ред е височината на кораба - реално число в интервала [1.00…20.00]
# •	На четвъртия ред е средната височина на астронавтите  -  реално число в интервала [1.50 … 1.90]
# Изход:
# Да се отпечата на конзолата един ред:
# •	Ако броят на астронавтите е между 3 (вкл.) и 10 (вкл.):
# "The spacecraft holds {броя на астронавтите} astronauts."
# •	Ако  броят на астронавтите е по-малък от 3:
#  "The spacecraft is too small."
# •	Ако  броят на астронавтите е по-голям от 10:
# "The spacecraft is too big."
from math import floor
width = float(input())
lenght = float(input())
height = float(input())
average_height = float(input())
volume_of_ship = width * lenght * height
volume_of_person = (average_height + 0.40) * 2 * 2
need_volume = volume_of_ship / volume_of_person
if 3 <= floor(need_volume) <= 10:
    print(f"The spacecraft holds {floor(need_volume)} astronauts." )
elif floor(need_volume) < 3:
    print("The spacecraft is too small.")
else:
    print("The spacecraft is too big.")

