# В най-голямата компютърна зала в България цените варират поради голямата посещаемост. Таксите на залата са в зависимост от това дали е ден или нощ, както и месецът,  в който се посещава залата. Цените са следните:
# 	Март до Май	Юни до Август
#  Ден	10.50 лв/ч	12.60 лв/ч
#  Нощ	8.40 лв/ч	10.20 лв/ч
# Предлагат се и следните отстъпки в следната последователност:
# •	За група от четирима или повече човека, цената на човек се намаля с 10%
# •	За 5 или повече часа прекарани, цената на човек се намаля с 50%
# Да се напише програма, която изчислява цената на човек за час и общата сума.
# Вход:
# Входът се чете от конзолата и съдържа точно 4 реда:
# •	На първия ред - месецът - текст с възможности: "march", "april", "may", "june", "july", "august"
# •	На втория ред - броят на прекараните часове - цяло число в диапазона [1...10]
# •	На третия ред - броят на хората в групата -  цяло число в диапазона [1...10]
# •	На четвъртия ред - времето от деня – текст с възможности: "day", "night"
# Изход:
# Да се отпечатат на конзолата 2 реда:
# •	На първия ред: "Price per person for one hour: {цена на човек за час}"
# •	На втория ред: "Total cost of the visit: {общата цена}"
# Цените да бъдат закръглени до втория знак след десетичната запетая.
month = input()
hours = int(input())
people = int(input())
day_or_night = input()
price = 0
if day_or_night == "day":
    if month == "march" or month == "april" or month == "may":
        price = 10.5
    elif month == "june" or month == "august" or month == "july":
        price = 12.60
elif day_or_night == "night":
    if month == "march" or month == "april" or month == "may":
        price = 8.40
    elif month == "june" or month == "august" or month == "july":
        price = 10.20
if people >= 4:
    price *= 0.9
if hours > 5:
    price *= 0.5
print(f"Price per person for one hour: {price:.2f}")
print(f"Total cost of the visit: {(price * people * hours):.2f}")
