# В приют за животни има определен брой котки, които изяждат различно количество храна на ден. Задачата ви е да изчислите колко е броят на котките във всяка група и парите, които са нужни на собственика за храната им за един ден, ако 1 кг храна = 12.45 лева.
# •	Ако котката изяжда от 100 (вкл.)  до 200 грама, то тя попада в група 1: малки котки.
# •	Ако котката изяжда от 200 (вкл.)  до 300 грама, то тя попада в група 2: големи котки.
# •	Ако котката изяжда от 300 (вкл.)  до 400 грама, то тя попада в група 3: огромни котки.
# Вход:
# •	На първи ред - броят на котките - цяло число в интервала [1..100]
# •	На всеки следващ ред за всяка котка - Х грама храна - реално число в интервала [100.00..400.00]
# Изход:
# Отпечатват се следните редове:
# “Group 1: {броят на котките в група 1: малки котки} cats.”
# “Group 2: {броят на котките в група 2: големи котки} cats.”
# “Group 3: {броят на котките в група 3: огромни котки} cats.”
# “Price for food per day: {цената за храната} lv.”
# Цената на храната трябва да бъде закръглена до втория знак след десетичната запетая.
cats = int(input())
small = 0
middle = 0
big = 0
all_food_in_grams = 0
for c in range(1 , cats + 1):
    food = int(input())
    if 100 <= food < 200:
        small += 1
    elif 200 <= food < 300:
        middle += 1
    elif 300 <= food < 400:
        big += 1
    all_food_in_grams += food
kg = all_food_in_grams / 1000
price = kg * 12.45
print(f'Group 1: {small} cats.')
print(f'Group 2: {middle} cats.')
print(f'Group 3: {big} cats.')
print(f'Price for food per day: {price:.2f} lv.')