# Задача 2. Сафари
# Симона и Светлин ще ходят на почивка в Африка и искат да отидат на сафари.
# Понеже за делничните дни вече имат планове, решават, че ще отидат събота
# или неделя. Напишете програма, която изчислява колко ще им струва ходенето
# на сафари и дали бюджетът им ще им стигне да отидат, като имате предвид следното:
# •	Цената на един литър гориво е 2.10 лв.
# •	Цената за екскурзовод е 100лв.
# •	В зависимост от деня има отстъпки от общата цена - за събота 10%, а за неделя 20%
# Вход
# От конзолата се четат 3 реда:
# •	Бюджет – реално число в интервала [0.00… 10000.00]
# •	Колко литра гориво ще са им нужни – реално число в интервала [1.00… 50.00]
# •	Ден от седмицата – текст с възможности "Saturday" и "Sunday"
# Изход
# Да се отпечата на конзолата един ред:
# •	Ако бюджетът е достатъчен:
# "Safari time! Money left: {колко пари са им останали} lv. "
# •	Ако бюджетът не е достатъчен:
# "Not enough money! Money needed: {колко пари не им достигат} lv."
# Сумите трябва да са форматирани до втория знак след десетичната запетая.
budget = float(input())
fuel = float(input())
day = input()
all_cost = fuel * 2.1 + 100
if day == "Saturday":
    all_cost *= 0.9
elif day == "Sunday":
    all_cost *= 0.8
if budget >= all_cost:
    print(f"Safari time! Money left: {abs(budget - all_cost):.2f} lv. ")
else:
    print(f"Not enough money! Money needed: {abs(budget - all_cost):.2f} lv.")