# Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и други животни.
# Една опаковка храна за кучета е на цена 2.50лв., а всяка останала, която не е за тях струва 4лв.
# Вход
# От конзолата се четат 2 реда:
# 1.	Броят на кучетата - цяло число;
# 2.	Броят на останалите животни  - цяло число.
# Изход
# На конзолата се отпечатва:
# "{крайната сума} lv."
count_of_dogs = int(input())
count_of_the_other_animals = int(input())
all_cost = count_of_the_other_animals * 4 + count_of_dogs * 2.5
print(f'{all_cost} lv.')