# Поздравления, поради вашите задълбочени знания в сферата на програмирането МВР реши да наеме точно вас за създаването на новата им система за генериране на специални автомобилни номера. Всеки един специален автомобилен номер се състой от четири числа. Условията, които разграничават специалните от обикновените номера са следните:
# •	Ако номерът започва с четна цифра, то той трябва да завършва на нечетна цифра и обратното – ако започва с нечетна,  завършва на четна
# •	Първата цифра от номера е по-голяма от последната
# •	Сумата от втората и третата цифра трябва да е четно число
# Входа се състой от две числа - начало и край на интервал, между които трябва да се генерира всяко едно число от номера.
# Вход
# 1.	Първи ред - едноцифрено число - началото на интервала – цяло число в интервала [1…9]
# 2.	Втори ред - едноцифрено число - края на интервала – цяло число в интервала [1…9]
# Изход
# На конзолата трябва да се отпечатат всички специални номера, разделени с интервал.
beginning_number = int(input())
final_number = int(input())
for first in range(beginning_number , final_number + 1):
    for second in range( beginning_number, final_number + 1 ):
        for third in range( beginning_number, final_number + 1 ):
            for forth in range( beginning_number, final_number + 1 ):
                if first % 2 == 0 and forth % 2 != 0 and first > forth :
                    if (second + third) % 2 == 0:
                        print( f'{first}{second}{third}{forth}' , end = ' ' )
                elif forth % 2 == 0 and first % 2 != 0 and first > forth:
                    if (second + third) % 2 == 0:
                        print( f'{first}{second}{third}{forth}' , end=' ' )

