# Младоженците искат да направят списък кой на кое място ще седи на сватбената церемония. Местата са разделени на различни сектори. Секторите са главните латински букви като започват от A. Във всеки сектор има определен брой редове. От конзолата се чете броят на редовете в първия сектор (A), като във всеки следващ сектор редовете се увеличават с 1. На всеки ред има определен брой места - тяхната номерация е представена с малките латински букви. Броя на местата на нечетните редове се прочита от конзолата, а на четните редове местата са с 2 повече.
# Вход
# От конзолата се четaт 3 реда:
# •	Последния сектор от секторите - символ (B-Z)
# •	Броят на редовете в първия сектор - цяло число (1-100)
# •	Броят на местата на нечетен ред - цяло число (1-24)
# Изход
# Да се отпечата на конзолата всяко място на отделен ред по следния формат:
# {сектор}{ред}{място}
# Накрая трябва да отпечата броя на всички места.
bigger_letter = input()
num_of_rows = int(input())
num_of_seats_at_first = int(input())
counter = 0
for sectors in range(65 , ord(bigger_letter) + 1):
    sectors = chr(sectors)
    for rows in range(1 , num_of_rows + 1):
        num_of_seats = num_of_seats_at_first
        if rows % 2 == 0:
            num_of_seats += 2
            for seat in range(97 , 97 + num_of_seats):
                seat = chr(seat)
                print( f'{sectors}{rows}{seat}' )
                counter += 1
        else:

            for seat in range(97, 97 + num_of_seats):
                seat = chr(seat)
                print(f'{sectors}{rows}{seat}')
                counter += 1
    num_of_rows += 1
print(counter)