# В града има тайна врата, за която всички знаят, но никой не е успявал да я отключи и да види какво има зад нея. За да бъде отключена трябва да се въведе трицифрен код.
# Напишете програма, която генерира комбинации спрямо въведени числа – предположения от потребителя. От конзолата се въвеждат три цифри. Тези цифри ще бъдат горната граница, до която ние искаме да получим всички трицифрени числа, на които всяка една цифра отговаря на следните условия:
# •	Цифрата на единиците и цифрата на стотиците трябва да бъде четна
# •	Цифрата на десетиците да бъде просто число в диапазона (2...7).
# Това ще са възможните комбинации според въведените предположения от потребителя, с които ще може евентуално да се отключи вратата.
# Вход
# От конзолата се четат 3 реда:
# •	Горната граница на стотиците - цяло число в диапазона (1-9)
# •	Горната граница на десетиците - цяло число в диапазона (1-9)
# •	Горната граница на единиците - цяло число в диапазона (1-9)
# Изход
# Да се отпечатат на конзолата всички трицифрени числа, за които всяка една част отговаря на условията по-горе.
max_for_first = int(input())
max_for_second = int(input())
max_for_third = int(input())
is_prime = False
for first in range(2 , max_for_first + 1):
    if first % 2 == 0:
        for second in range( 2, max_for_second + 1 ):
            for i in range( 2,second):
                if second % i == 0:
                    break
            else:
                for third in range( 2, max_for_third + 1 ):
                    if third % 2 == 0:
                        print(f'{first} { second} {third}')