# Прапраправнукът на Сали Яшар е получил наследство - сейф с парола - четири цифри. В него е заключена тайната на пеещите каруци. Той има автосервиз и се нуждае от реклама, затова е решил да направи такава каруца. Проблема е, че паролата е скрита в следната задача:
# „Парола ще получиш, ако знаеш  едно цяло число, контролна стойност  се нарича то,
# почива в интервала от 4 до 144 включително, но да го откриеш може би ще е мъчително. ”
# Паролата има формат: "abcd" и контролната стойност трябва да е равна на  a*b + c*d , но трябва да бъдат спазени следните условия:
# •	при намирането на а и b: a < b
# •	при намиране на  c и d: c > d .
# Каруцата  има четири колела, затова паролата ще е четвърто число, което трябва да се отпечата.
# В случай, че НЕ се намери такова число,  отпечатва се „No!“.
# Вход
# От конзолата се чете едно цяло число (контролната стойност): M – цяло число в интервала [4 … 144];
# Изход
# Отпечатването на конзолата зависи от резултата:
# •	Ако са намерени четворки числа (аbcd), отговарящи на условието, ги отпечатваме всичките с разделител интервал: “{а}{b}{c}{d} ”
# •	Отпечатва се един от двата реда на нов ред:
# •	Ако съществува четвърта четворка се отпечатва: „Password: {а}{b}{c}{d}“
# •	Ако НЕ са намерени такива числа или няма  четвърта четворка отпечатваме: “No!”
magical_number = int(input())
counter = 0
is_password = False
password = ''
for a in range(1 , 10):
    for b in range(1, 10):
        for c in range(1, 10):
            for d in range(1, 10):
                if a * b + c * d == magical_number:
                    if a < b and  c > d:
                        counter += 1
                        print(f'{a}{b}{c}{d}' , end = ' ' )
                        if counter == 4:
                            is_password = True
                            password = f'{a}{b}{c}{d}'
print()
if is_password:
    print(f"Password: {password}")
else:
    print('No!')