# Задача 4. Кино ваучер
# Любо е голям почитател на киното и редовно ходи на прожекции и участва в томболи, от които често печели ваучери за кино. Вашата задача е да напишете програма, която да изчислява колко покупки от киното може да си купи Любо със спечеленият ваучер. Ако името на покупката съдържа повече от 8 символа, то тя е билет за филм, а нейната цена представлява сумата на ASCII символите от първите ѝ два символа. Ако името на покупката съдържа 8 или по-малко символа, нейната цена е равна на стойността на първия ASCII символ в името. Любо въвежда името на покупките, които желае, докато не въведе "End" или не въведе покупка, чиято стойност е по-голяма от останалата сума на ваучера.
# Вход
# Първоначално се чете един ред:
# •	Стойността на ваучера – цяло число в интервала [1…100000]
# След това до получаване на команда "End" или до изчерпването на ваучера, се чете по един ред:
# o	Покупката, която Любо е избрал – текст
# Изход
# Програмата приключва при въвеждане на команда "End" или при покупка чиято стойност е по-голяма от останалите пари от ваучера. На конзолата трябва да се напечатат три реда:
# •	"{брои закупени билети}"
# •	"{брой закупени други покупки}"
vaucher = float(input())
command = input()
price = 0
ticket = 0
payment = 0
while command != "End":
    is_payment = False
    if len(command) > 8:
        price += ord(command[0]) + ord(command[1])
    else:
        is_payment = True
        price += ord(command[0])
    if vaucher < price:
        break
    else:
        if is_payment:
            payment += 1
        else:
            ticket += 1
        vaucher -= price
        price = 0
    command = input()
print(ticket)
print(payment)

