# Задача 1 от Урок 1-Упражнения
# Трябва да се вкарат три числа в конзолата, които трябва да бъдат съответно: височината и двете основи на трапец.
a = float(input())  # По-голямата основа
b = float(input())   # По-малката основа
h = float(input())  # Това е височината
area = ((a + b) * h) / 2
print(f"{area:.2f}")