#  Това е 7 задача от урок 1 - Упражнения
# Напишете програма, която да пресмята колко литра боя е нужна за боядисването на къщa.
# Като за стените се използва зелена боя, а за покрива – червена.
# Разхода на зелената боя е 1 литър за 3.4 м2, а на червената – 1 литър за 4.3 м2.
# Стените имат следните размери:
# Предната и задната стена са квадрати със страна „x“
# на предната стена има правоъгълна врата с широчина 1.2м и височина 2м
# Страничните стени са правоъгълници със страни „x“ и „y“
# и на двете странични стени има по един квадратен прозорец със страна 1.5м
# Покривът има следните размери:
# Два правоъгълника със страни „x“ и „y“
# Два равностранни триъгълника със страна „x“ и височина „h“
# Трябва да пресметнете площта на всички страни и площта на покрива, за да
# намерите колко литра от всяка боя ще са нужни.

x = float(input())  # Това е височината на стената
y = float(input())  # Това е дължината на страничните стени и на покрива от гледна точка на пр. страни
h = float(input())   # Това е височината на триъгълната страна на покрива
# Предни две стени(без врати)
front_doors = (2 * (x * x)) - 2.4  # Предна стени
side_doors = (2 * (x * y)) - 4.5   # Странична стени
roof_front = x * h
roof_side = 2 * x * y
roof = roof_front + roof_side
green = (front_doors + side_doors) / 3.4
red = roof / 4.3
print(f'{green:.2f}')
print(f'{red:.2f}')

