# Курсът "Train the trainers" е към края си и финалното оценяване наближава. Вашата задача е да помогнете на журито, което ще оценява презентациите, като напишете програма, в която да изчислява средната оценка от представянето на всяка една презентация от даден студент, а накрая - средния успех от всички тях.
# От конзолата на първият ред се прочита броят на хората в журито n - цяло число.
# След това на отделен ред се прочита името на презентацията – текст.
# За всяка една презентация на нов ред се четат n - на брой оценки - реално число.
# След изчисляване на средната оценка за конкретна презентация, на конзолата се печата:
#  "{името на презентацията} - {средна оценка}."
# След получаване на команда "Finish", на конзолата се печата "Student's final assessment is {среден успех от всички презентации}." и програмата приключва.
# Всички оценки трябва да бъдат форматирани до втория знак след десетичната запетая.
judge = int(input())
command = input()
counter = 0
sum_of_all_grades = 0
while command != "Finish":
    presentation_name = command
    middle_grade = 0
    for grades in range(1 , judge + 1):
        grade = float( input() )
        counter += 1
        sum_of_all_grades += grade
        middle_grade += grade
    middle_grade /= judge
    print(f"{presentation_name} - {middle_grade:.2f}.")
    command = input()
print(f"Student's final assessment is {(sum_of_all_grades / counter):.2f}.")






